Ror_Project/simple_blog/app/controllers/articles_controller.rb

  def destroy
      @article = Article.destroy(params[:id])
---
DELETE FROM "articles" WHERE "articles"."id" = ?  [["id", 6]]

  def update
    @article = Article.find(params[:id])
    @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "articles" SET "image_file_name" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["image_file_name", "beast.png"], ["image_updated_at", "2017-11-04 00:13:50.477914"], ["updated_at", "2017-11-04 00:13:50.649281"], ["id", 10]]